Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ТерминыЭлектронныхГлоссариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыЭлектронныхГлоссариев</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Определение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОпределение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Определение = ТекущийОбъект.Определение.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.КраткоеОпределение = Определение.ПолучитьТекст();
	ТекущийОбъект.Определение = Новый ХранилищеЗначения(Определение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ТерминГлоссарияОбновлен", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.БукваДляПоиска) Тогда
		Объект.БукваДляПоиска = БукваДляПоискаОпределения(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСинонимы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Синонимы

&НаКлиенте
Процедура СинонимыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Для каждого СтрокаТС Из Объект.Синонимы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТС.БукваДляПоиска) Тогда
			СтрокаТС.БукваДляПоиска = БукваДляПоискаОпределения(СтрокаТС.Представление);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Функция БукваДляПоискаОпределения(Знач ПредставлениеТермина)
	Возврат РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.БукваДляПоискаТермина(ПредставлениеТермина);	
КонецФункции


#КонецОбласти
